Revit 2026 API

# CurveLoopCreate Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static CurveLoop Create(
	IList<Curve> curves
)
```
```vb
Public Shared Function Create (
	curves As IList(Of Curve)
) As CurveLoop
```
```cpp
public:
static CurveLoop^ Create(
	IList<Curve^>^ curves
)
```
```fsharp
static member Create :
        curves : IList<Curve> -> CurveLoop
```

#### Parameters

curves IListCurve

#### Return Value

CurveLoop

#### Reference

CurveLoop Class

Autodesk.Revit.DB Namespace